requisições/req_2026-02-26T14-32-27-983Z_SaveRecord.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:SaveRecord>
         <!--Optional:-->
         <tot:DataServerName>GlbConsSqlData</tot:DataServerName>
         <!--Optional:-->
         <tot:XML><![CDATA[<GlbConsSql>
  <GConsSql>
    <CODCOLIGADA>1</CODCOLIGADA>
    <APLICACAO>T</APLICACAO>
    <CODSENTENCA>SIT.PORTALRM.014</CODSENTENCA>
    <TITULO>Retorna Natureza Orçamentária</TITULO>
    <SENTENCA>select * from ttborcamento where codcoligada = 1</SENTENCA>
    <TAMANHO>48</TAMANHO>
    <DTULTALTERACAO>2026-02-26T11:32:27.0000000-03:00</DTULTALTERACAO>
    <USRULTALTERACAO>mestre</USRULTALTERACAO>
    <DISPONIVELFILTRO>1</DISPONIVELFILTRO>
    <DISPONIVELRELATORIO>1</DISPONIVELRELATORIO>
    <DISPONIVELVISAO>1</DISPONIVELVISAO>
    <DISPONIVELMENU>0</DISPONIVELMENU>
    <SEMSEGCOLUNAS>0</SEMSEGCOLUNAS>
    <SEMSEGESTENDIDA>0</SEMSEGESTENDIDA>
    <GUID>7adedf4f-c954-4fa0-b3c3-5497da20a493</GUID>
    <CONTROLE>46121</CONTROLE>
  </GConsSql>
</GlbConsSql>]]></tot:XML>
         <!--Optional:-->
         <tot:Contexto>CODCOLIGADA=1;CODUSUARIO='mestre';CODSISTEMA=T</tot:Contexto>
      </tot:SaveRecord>
   </soapenv:Body>
</soapenv:Envelope>